import Base.Math: @horner

const sqrtpi = 1.772453850905516027298

# Pochhhammer symbol (x)ₙ for the rising factorial. From ApproxFun.

function pochhammer(x::Number,n::Integer)
    ret = one(x)
    if n≥0
        for i=0:n-1
            ret *= x+i
        end
    else
        ret /= pochhammer(x+n,-n)
    end
    ret
end

pochhammer{T<:Number}(x::AbstractArray{T,1},n::Integer) = [pochhammer(x[i],n) for i=1:length(x)]
pochhammer{T<:Number}(x::AbstractArray{T,2},n::Integer) = [pochhammer(x[i,j],n) for i=1:size(x,1),j=1:size(x,2)]
pochhammer{T<:Number}(x::AbstractArray{T},n::Integer) = reshape([ pochhammer(x[i],n) for i in eachindex(x) ], size(x))

pochhammer(x::Number,n::Number) = gamma(x+n)/gamma(x)
pochhammer{T<:Number}(x::AbstractArray{T},n::Number) = gamma(x+n)./gamma(x)

function pochhammer{T<:Real}(x::Number,n::UnitRange{T})
    ret = Vector{promote_type(typeof(x),T)}(length(n))
    ret[1] = pochhammer(x,first(n))
    for i=2:length(n)
        ret[i] = (x+n[i]-1)*ret[i-1]
    end
    ret
end

# Stirling series for Γ(z)

stirlingseries(z) = gamma(z)*sqrt((z/π)/2)*exp(z)/z^z

function stirlingseries(z::Float64)
    if z ≥ 3274.12075200175       # N =  4
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03)
    elseif z ≥ 590.1021805526798  # N =  5
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04)
    elseif z ≥ 195.81733962412835 # N =  6
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04)
    elseif z ≥ 91.4692823071966   # N =  7
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05)
    elseif z ≥ 52.70218954633605  # N =  8
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04)
    elseif z ≥ 34.84031591198865  # N =  9
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05)
    elseif z ≥ 25.3173982783047   # N = 10
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04)
    elseif z ≥ 19.685015283078513 # N = 11
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05)
    elseif z ≥ 16.088669099569266 # N = 12
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05,-1.914438498565477526500898858328522544876893578953503896119485486078256623676663e-03)
    elseif z ≥ 13.655055978888104 # N = 13
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05,-1.914438498565477526500898858328522544876893578953503896119485486078256623676663e-03,-1.625162627839158168986351239802709981058725919322518870384880567497861723029629e-04)
    elseif z ≥ 11.93238782087875  # N = 14
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05,-1.914438498565477526500898858328522544876893578953503896119485486078256623676663e-03,-1.625162627839158168986351239802709981058725919322518870384880567497861723029629e-04,6.403362833808069794823638090265795830401894093962864676301495665407594627808272e-03)
    elseif z ≥ 10.668852439197263 # N = 15
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05,-1.914438498565477526500898858328522544876893578953503896119485486078256623676663e-03,-1.625162627839158168986351239802709981058725919322518870384880567497861723029629e-04,6.403362833808069794823638090265795830401894093962864676301495665407594627808272e-03,5.40164767892604515180467508570241735547254415979217175042122014107572377089416e-04)
    elseif z ≥ 9.715358216638403  # N = 16
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05,-1.914438498565477526500898858328522544876893578953503896119485486078256623676663e-03,-1.625162627839158168986351239802709981058725919322518870384880567497861723029629e-04,6.403362833808069794823638090265795830401894093962864676301495665407594627808272e-03,5.40164767892604515180467508570241735547254415979217175042122014107572377089416e-04,-2.952788094569911906397482537591847109556414086866728343527599982978874278241523e-02)
    elseif z ≥ 8.979120323411497  # N = 17
        @horner(inv(z),1.0,8.333333333333333333333333333333333333333333333333333333333333333333333333333369e-02,3.472222222222222222222222222222222222222222222222222222222222222222222222222215e-03,-2.681327160493827160493827160493827160493827160493827160493827160493827160493839e-03,-2.294720936213991769547325102880658436213991769547325102880658436213991769547334e-04,7.840392217200666274740348814422888496962571036645110719184793258867332941407013e-04,6.972813758365857774293988285757833082935963594399808391577938903041783700219962e-05,-5.921664373536938828648362256044011873915851967978168252516675013245657964450818e-04,-5.171790908260592193370578430020588228178534534272988776875379527414278214461134e-05,8.39498720672087279993357516764983445198182111593007628503572550042430988763692e-04,7.204895416020010559085719302250150520634517379754789525044898104721705621361993e-05,-1.914438498565477526500898858328522544876893578953503896119485486078256623676663e-03,-1.625162627839158168986351239802709981058725919322518870384880567497861723029629e-04,6.403362833808069794823638090265795830401894093962864676301495665407594627808272e-03,5.40164767892604515180467508570241735547254415979217175042122014107572377089416e-04,-2.952788094569911906397482537591847109556414086866728343527599982978874278241523e-02,-2.481743600264997908117784815628212251392939090210182309899976306369140724437755e-03)
    else
        gamma(z)*sqrt(z/2π)*exp(z)/z^z
    end
end

@vectorize_1arg Number stirlingseries

stirlingremainder(z::Number,N::Int) = (1+zeta(N))*gamma(N)/((2π)^(N+1)*z^N)/stirlingseries(z)
stirlingremainder{T<:Number}(z::AbstractVector{T},N::Int) = (1+zeta(N))*gamma(N)/(2π)^(N+1)./z.^N./stirlingseries(z)

Aratio(n::Int,α::Float64,β::Float64) = exp((n/2+α+1/4)*log1p(-β/(n+α+β+1))+(n/2+β+1/4)*log1p(-α/(n+α+β+1))+(n/2+1/4)*log1p(α/(n+1))+(n/2+1/4)*log1p(β/(n+1)))
Aratio(n::Number,α::Number,β::Number) = (1+(α+1)/n)^(n+α+1/2)*(1+(β+1)/n)^(n+β+1/2)/(1+(α+β+1)/n)^(n+α+β+1/2)/(1+(zero(α)+zero(β))/n)^(n+1/2)
Aratio(n::AbstractVector,α::Number,β::Number) = [ Aratio(n[i],α,β) for i=1:length(n) ]

Cratio(n::Int,α::Float64,β::Float64) = exp((n+α+1/2)*log1p((α-β)/(2n+α+β+2))+(n+β+1/2)*log1p((β-α)/(2n+α+β+2))-log1p((α+β+2)/2n)/2)/sqrt(n)
Cratio(n::Number,α::Number,β::Number) = n^(-1/2)*(1+(α+1)/n)^(n+α+1/2)*(1+(β+1)/n)^(n+β+1/2)/(1+(α+β+2)/2n)^(2n+α+β+3/2)
Cratio(n::AbstractVector,α::Number,β::Number) = [ Cratio(n[i],α,β) for i=1:length(n) ]


Anαβ(n::Number,α::Number,β::Number) = 2^(α+β+1)/(2n+α+β+1)*exp(lgamma(n+α+1)-lgamma(n+α+β+1)+lgamma(n+β+1)-lgamma(n+1))
function Anαβ(n::Integer,α::Number,β::Number)
    if n==0
        2^(α+β+1)*beta(α+1,β+1)
    else
        val = Anαβ(0,α,β)
        for i=1:n
            val *= (i+α)*(i+β)/(i+α+β)/i*(2i+α+β-1)/(2i+α+β+1)
        end
        val
    end
end

function Anαβ(n::Integer,α::Float64,β::Float64)
    if n+min(α,β,α+β,0) ≥ 7.979120323411497
        2.^(α+β+1)/(2n+α+β+1)*stirlingseries(n+α+1)*Aratio(n,α,β)/stirlingseries(n+α+β+1)*stirlingseries(n+β+1)/stirlingseries(n+one(Float64))
    else
        (n+1)*(n+α+β+1)/(n+α+1)/(n+β+1)*Anαβ(n+1,α,β)*((2n+α+β+3)/(2n+α+β+1))
    end
end

Anαβ{T<:Integer}(n::AbstractVector{T},α::Number,β::Number) = [ Anαβ(n[i],α,β) for i=1:length(n) ]
Anαβ{T<:Integer}(n::AbstractMatrix{T},α::Number,β::Number) = [ Anαβ(n[i,j],α,β) for i=1:size(n,1), j=1:size(n,2) ]


#
# This uses the asymptotic series for τ in Appendix B of
#
# I. Bogaert and B. Michiels and J. Fostier, 𝒪(1) computation of Legendre polynomials and Gauss--Legendre nodes and weights for parallel computing, SIAM J. Sci. Comput., 34:C83--C101, 2012.
#
Cx(x::Number) = exp(lgamma(x+1/2)-lgamma(x+1))
function Cx(x::Float64)
    if x > 9.84475
        xp = x+0.25
        @horner(inv(xp^2),1.0,-1.5625e-02,2.5634765625e-03,-1.2798309326171875e-03,1.343511044979095458984375e-03,-2.432896639220416545867919921875e-03,6.7542375336415716446936130523681640625e-03)/sqrt(xp)
    else
        (x+1.0)*Cx(x+1.0)/(x+0.5)
    end
end
@vectorize_1arg Number Cx

Cnλ(n::Integer,λ::Float64) = 2^λ/sqrtpi*Cx(n+λ)
Cnλ(n::Integer,λ::Number) = 2^λ/sqrt(convert(typeof(λ),π))*Cx(n+λ)
function Cnλ{T<:Integer}(n::UnitRange{T},λ::Number)
    ret = Vector{typeof(λ)}(length(n))
    ret[1] = Cnλ(first(n),λ)
    for i=2:length(n)
        ret[i] = (n[i]+λ-1/2)/(n[i]+λ)*ret[i-1]
    end
    ret
end

Cnλ{T<:Integer}(n::AbstractVector{T},λ::Number) = [ Cnλ(n[i],λ) for i=1:length(n) ]
Cnλ{T<:Integer}(n::AbstractMatrix{T},λ::Number) = [ Cnλ(n[i,j],λ) for i=1:size(n,1), j=1:size(n,2) ]

function Cnmλ(n::Integer,m::Integer,λ::Number)
    if m == 0
        Cnλ(n,λ)
    else
        (λ+m-1)/2/m*(m-λ)/(n+λ+m)*Cnmλ(n,m-1,λ)
    end
end

Cnmλ{T<:Integer}(n::AbstractVector{T},m::Integer,λ::Number) = [ Cnmλ(n[i],m,λ) for i=1:length(n) ]


function Cnαβ(n::Integer,α::Number,β::Number)
    if n==0
        2^(α+β+1)*beta(α+1,β+1)/π
    else
        val = Cnαβ(0,α,β)
        for i=1:n
            val *= (i+α)*(i+β)/(i+(α+β+1)/2)/(i+(α+β)/2)
        end
        val
    end
end

function Cnαβ(n::Integer,α::Float64,β::Float64)
    if n+min(α,β) ≥ 7.979120323411497
        stirlingseries(n+α+1)/sqrtpi/stirlingseries(2n+α+β+2)*Cratio(n,α,β)*stirlingseries(n+β+1)
    else
        (n+(α+β+3)/2)/(n+β+1)*(n+(α+β+2)/2)/(n+α+1)*Cnαβ(n+1,α,β)
    end
end

Cnαβ{T<:Integer}(n::AbstractVector{T},α::Number,β::Number) = [ Cnαβ(n[i],α,β) for i=1:length(n) ]
Cnαβ{T<:Integer}(n::AbstractMatrix{T},α::Number,β::Number) = [ Cnαβ(n[i,j],α,β) for i=1:size(n,1), j=1:size(n,2) ]

function Cnmαβ(n::Integer,m::Integer,α::Number,β::Number)
    if m == 0
        Cnαβ(n,α,β)
    else
        Cnmαβ(n,m-1,α,β)/2(2n+α+β+m+1)
    end
end

Cnmαβ{T<:Integer}(n::AbstractVector{T},m::Integer,α::Number,β::Number) = [ Cnmαβ(n[i],m,α,β) for i=1:length(n) ]
Cnmαβ{T<:Integer}(n::AbstractMatrix{T},m::Integer,α::Number,β::Number) = [ Cnmαβ(n[i,j],m,α,β) for i=1:size(n,1), j=1:size(n,2) ]

function Cnmαβ{T<:Number}(n::Integer,m::Integer,α::AbstractArray{T},β::AbstractArray{T})
    shp = promote_shape(size(α),size(β))
    reshape([ Cnmαβ(n,m,α[i],β[i]) for i in eachindex(α,β) ], shp)
end


function absf(α::Number,β::Number,m::Int,θ::Number)
    ret = zero(θ)
    for l=0:m
        ret += pochhammer(1/2+α,l)*pochhammer(1/2-α,l)*pochhammer(1/2+β,m-l)*pochhammer(1/2-β,m-l)/factorial(l)/factorial(m-l)/sinpi(θ/2)^(l+α+1/2)/cospi(θ/2)^(m-l+β+1/2)
    end
    ret
end

function absf{T<:Number}(α::AbstractArray{T},β::AbstractArray{T},m::Int,θ::Number)
    shp = promote_shape(size(α),size(β))
    reshape([ absf(α[i],β[i],m,θ) for i in eachindex(α,β) ], shp)
end

function absf{T<:Number}(α::Number,β::Number,m::Int,θ::AbstractArray{T,1})
    ret = zero(θ)
    cfs = zeros(T,m+1)
    for l=0:m
        @inbounds cfs[l+1] = pochhammer(1/2+α,l)*pochhammer(1/2-α,l)*pochhammer(1/2+β,m-l)*pochhammer(1/2-β,m-l)/factorial(l)/factorial(m-l)
    end
    @inbounds for i=1:length(θ),l=0:m
        ret[i] += cfs[l+1]/sinpi(θ[i]/2)^(l+α+1/2)/cospi(θ[i]/2)^(m-l+β+1/2)
    end
    ret
end
absf{T<:Number}(α::Number,β::Number,m::Int,θ::AbstractArray{T,2}) = [ absf(α,β,m,θ[i,j]) for i=1:size(θ,1), j=1:size(θ,2) ]
absf{T<:Number}(α::Number,β::Number,m::Int,θ::AbstractArray{T}) = reshape([ absf(α,β,m,θ[i]) for i in eachindex(θ) ], size(θ))

function compute_absf!{T<:AbstractFloat}(ret::Vector{T},cfs::Matrix{T},α::T,β::T,tempcos::Vector{T},tempsin::Vector{T},tempcosβsinα::Vector{T},m::Int)
    @inbounds for i=1:length(ret)
        temp = inv(tempcos[i]^m*tempcosβsinα[i])
        ret[i] = cfs[m+1,1]*temp
        for l=1:m
            temp *= tempcos[i]/tempsin[i]
            ret[i] += cfs[m+1,l+1]*temp
        end
    end
    ret
end

function compute_absf!{T<:AbstractFloat}(ret::Vector{T},tempsin::Vector{T},tempsinλ::Vector{T},m::Int)
    for i=1:length(ret)
        @inbounds ret[i] = inv(tempsin[i]^m*tempsinλ[i])
    end
    ret
end

function compute_umvm!{T<:AbstractFloat}(um::Vector{T},vm::Vector{T},cfs::Matrix{T},α::T,β::T,tempcos::Vector{T},tempsin::Vector{T},tempcosβsinα::Vector{T},m::Int,θ::Vector{T},ir::UnitRange{Int64})
    @inbounds for i in ir
        temp = inv(tempcos[i]^m*tempcosβsinα[i])
        ϑ = (α+1/2)/2-(α+β+m+1)*θ[i]/2
        um[i] = cfs[m+1,1]*cospi(ϑ)*temp
        vm[i] = cfs[m+1,1]*sinpi(ϑ)*temp
        @inbounds for l=1:m
            temp *= tempcos[i]/tempsin[i]
            ϑ = (α+l+1/2)/2-(α+β+m+1)*θ[i]/2
            um[i] += cfs[m+1,l+1]*cospi(ϑ)*temp
            vm[i] += cfs[m+1,l+1]*sinpi(ϑ)*temp
        end
    end
end

function compute_umvm!{T<:AbstractFloat}(um::Vector{T},vm::Vector{T},λ::T,tempsin::Vector{T},tempsinλ::Vector{T},m::Int,θ::Vector{T},ir::UnitRange{Int64})
    @inbounds for i in ir
        temp = inv(tempsin[i]^m*tempsinλ[i])
        ϑ = (m+λ)*(1/2-θ[i])
        um[i] = cospi(ϑ)*temp
        vm[i] = sinpi(ϑ)*temp
    end
end

function findmindices!{T<:AbstractFloat}(Rαβjm::Vector{T},cfs::Matrix{T},α::T,β::T,j::Int,m::Int,tempcos::Vector{T},tempsin::Vector{T},tempcosβsinα::Vector{T})
    compute_absf!(Rαβjm,cfs,α,β,tempcos,tempsin,tempcosβsinα,m)
    scale!(Rαβjm,Cnmαβ(j,m,α,β))
    rmin,imin = findmin(Rαβjm)
    if rmin < eps(T)
        i₁ = imin-1
        while i₁ ≥ 3
            if Rαβjm[i₁] < eps(T)
                i₁-=1
            else
                break
            end
        end
        i₂ = imin+1
        while i₂ ≤ length(Rαβjm)-2
            if Rαβjm[i₂] < eps(T)
                i₂+=1
            else
                break
            end
        end
        return i₁,i₂
    else
        return 1,0# error("There are no indices such that the interior asymptotic formula is valid.")# but adding an error is type-unstable :(.
    end
end

function findmindices!{T<:AbstractFloat}(Rαβjm::Vector{T},λ::T,j::Int,m::Int,tempsin::Vector{T},tempsinλ::Vector{T})
    compute_absf!(Rαβjm,tempsin,tempsinλ,m)
    scale!(Rαβjm,Cnmλ(j,m,λ))
    rmin,imin = findmin(Rαβjm)
    if rmin < eps(T)
        i₁ = imin-1
        while i₁ ≥ 3
            if Rαβjm[i₁] < eps(T)
                i₁-=1
            else
                break
            end
        end
        i₂ = imin+1
        while i₂ ≤ length(Rαβjm)-2
            if Rαβjm[i₂] < eps(T)
                i₂+=1
            else
                break
            end
        end
        return i₁,i₂
    else
        return 1,0# error("There are no indices such that the interior asymptotic formula is valid.")# but adding an error is type-unstable :(.
    end
end

# initialization methods

function init_cfs{T<:AbstractFloat}(α::T,β::T,M::Int)
    cfs = zeros(T,M+1,M+1)
    @inbounds for m=0:M,l=0:m
        cfs[m+1,l+1] = pochhammer(1/2+α,l)*pochhammer(1/2-α,l)*pochhammer(1/2+β,m-l)*pochhammer(1/2-β,m-l)/factorial(l)/factorial(m-l)
    end
    cfs
end

function init_c₁c₂!(c₁::Vector,c₂::Vector,a::Vector,b::Vector,j₁::Int,j₂::Int)
    @inbounds for j=1:j₁-1 c₁[j] = 0 end
    @inbounds for j=j₁:j₂ c₁[j] = a[j]*b[j] end
    @inbounds for j=j₂+1:length(c₁) c₁[j] = 0 end
    copy!(c₂,c₁)
end

function init_c₁c₂!(c₁::Vector,c₂::Vector,u::Vector,v::Vector,c::Vector,i₁::Int,i₂::Int)
    @inbounds for i=1:i₁-1
        c₁[i] = 0
        c₂[i] = 0
    end
    @inbounds for i=i₁:i₂
        c₁[i] = u[i]*c[i]
        c₂[i] = v[i]*c[i]
    end
    @inbounds for i=i₂+1:length(c₁)
        c₁[i] = 0
        c₂[i] = 0
    end
end

#
# Modified Chebyshev moments of the first and second kind with respect to the Jacobi weight
#
# ∫-₁¹ T_n(x) (1-x)^α(1+x)^β dx,  and  ∫-₁¹ U_n(x) (1-x)^α(1+x)^β dx.
#


function chebyshevjacobimoments1{T<:AbstractFloat}(N::Int,α::T,β::T)
    μ = zeros(T,N)
    N > 0 && (μ[1] = 2.^(α+β+1)*beta(α+1,β+1))
    if N > 1
        μ[2] = μ[1]*(β-α)/(α+β+2)
        for i=1:N-2
            @inbounds μ[i+2] = (2(β-α)*μ[i+1]-(α+β-i+2)*μ[i])/(α+β+i+2)
        end
    end
    μ
end

function chebyshevjacobimoments2{T<:AbstractFloat}(N::Int,α::T,β::T)
    μ = zeros(T,N)
    N > 0 && (μ[1] = 2.^(α+β+1)*beta(α+1,β+1))
    if N > 1
        μ[2] = 2μ[1]*(β-α)/(α+β+2)
        for i=1:N-2
            @inbounds μ[i+2] = (2(β-α)*μ[i+1]-(α+β-i)*μ[i])/(α+β+i+2)
        end
    end
    μ
end

# Compute the bi-diagonal increment/decrement operators to incrementally change Jacobi bases in-place.
## TODO: check incrementαβ! and decrementαβ!.
# incrementα! : domain space is Pₙ^(α,β), and range space Pₙ^(α+1,β)
# incrementβ! : domain space is Pₙ^(α,β), and range space Pₙ^(α,β+1)
# incrementαβ! : domain space is Pₙ^(α,α), and range space Pₙ^(α+1,α+1)
# decrementα! : domain space is Pₙ^(α,β), and range space Pₙ^(α-1,β)
# decrementβ! : domain space is Pₙ^(α,β), and range space Pₙ^(α,β-1)
# decrementαβ! : domain space is Pₙ^(α,α), and range space Pₙ^(α-1,α-1)

function incrementα!(c::AbstractVector,α,β)
    αβ,N = α+β,length(c)
    N > 1 && (c[1] -= (β+1)/(αβ+3)*c[2])
    @inbounds for i=2:N-1 c[i] = (αβ+i)/(αβ+2i-1)*c[i] - (β+i)/(αβ+2i+1)*c[i+1] end
    N > 1 && (c[N] *= (αβ+N)/(αβ+2N-1))
    c
end

function incrementβ!(c::AbstractVector,α,β)
    αβ,N = α+β,length(c)
    N > 1 && (c[1] += (α+1)/(αβ+3)*c[2])
    @inbounds for i=2:N-1 c[i] = (αβ+i)/(αβ+2i-1)*c[i] + (α+i)/(αβ+2i+1)*c[i+1] end
    N > 1 && (c[N] *= (αβ+N)/(αβ+2N-1))
    c
end
#=
function incrementαβ!(c::AbstractVector,α,β)
    @assert α == β
    N = length(c)
    @inbounds for i=1:N-2 c[i] = (2α+i-2)*(2α+i-1)/(2α+2i-1)/(2α+2i)*c[i] - (α+i+1)/(4α+4i+2)*c[i+2] end
    N > 1 && (c[N-1] *= (2α+N-3)*(2α+N-2)/(2α+2N-3)/(2α+2N-2))
    N > 2 && (c[N] *= (2α+N-2)*(2α+N-1)/(2α+2N-1)/(2α+2N))
    c
end
=#
function decrementα!(c::AbstractVector,α,β)
    αβ,N = α+β,length(c)
    N > 1 && (c[N] *= (αβ+2N-2)/(αβ+N-1))
    @inbounds for i=N-1:-1:2 c[i] = (αβ+2i-2)/(αβ+i-1)*c[i] + (αβ+2i-2)/(αβ+2i)*(β+i)/(αβ+i-1)*c[i+1] end
    N > 1 && (c[1] += (β+1)/(αβ+2)*c[2])
    c
end

function decrementβ!(c::AbstractVector,α,β)
    αβ,N = α+β,length(c)
    N > 1 && (c[N] *= (αβ+2N-2)/(αβ+N-1))
    @inbounds for i=N-1:-1:2 c[i] = (αβ+2i-2)/(αβ+i-1)*c[i] - (αβ+2i-2)/(αβ+2i)*(α+i)/(αβ+i-1)*c[i+1] end
    N > 1 && (c[1] -= (α+1)/(αβ+2)*c[2])
    c
end
#=
function decrementαβ!(c::AbstractVector,α,β)
    @assert α == β
    N = length(c)
    N > 1 && (c[N-1] *= (2α+2N-5)*(2α+2N-4)/(2α+N-5)/(2α+N-4))
    N > 2 && (c[N] *= (2α+2N-3)*(2α+2N-2)/(2α+N-4)/(2α+N-3))
    @inbounds for i=N-2:-1:1 c[i] = (2α+2i-3)*(2α+2i-2)/(2α+i-4)/(2α+i-3)*(c[i] + (α+i)/(4α+4i-2)*c[i+2])  end
    c
end
=#

function modαβ(α)
    if -0.5 < α ≤ 0.5
        a = α
    else
        a = α%1
        a > 0.5 && (a-=1)
        a ≤ -0.5 && (a+=1)
    end
    a
end

function tosquare!(ret::AbstractVector,α,β)
    a,b = modαβ(α),modαβ(β)
    A,B = α-a,β-b
    if α ≤ -0.5 && β ≤ -0.5
        incrementα!(ret,α,β)
        incrementβ!(ret,a,β)
    elseif α ≤ -0.5
        incrementα!(ret,α,β)
        for j=B:-1:1
            decrementβ!(ret,a,j+b)
        end
    elseif β ≤ -0.5
        incrementβ!(ret,α,β)
        for i=A:-1:1
            decrementα!(ret,i+a,b)
        end
    else
        for i=A:-1:1
            decrementα!(ret,i+a,β)
        end
        for j=B:-1:1
            decrementβ!(ret,a,j+b)
        end
    end
    ret
end

function fromsquare!(ret::AbstractVector,α,β)
    a,b = modαβ(α),modαβ(β)
    A,B = α-a,β-b
    if α ≤ -0.5 && β ≤ -0.5
        decrementα!(ret,a,b)
        decrementβ!(ret,α,b)
    elseif α ≤ -0.5
        decrementα!(ret,a,b)
        for j=0:B-1
            incrementβ!(ret,α,j+b)
        end
    elseif β ≤ -0.5
        decrementβ!(ret,a,b)
        for i=0:A-1
            incrementα!(ret,i+a,β)
        end
    else
        for i=0:A-1
            incrementα!(ret,i+a,b)
        end
        for j=0:B-1
            incrementβ!(ret,α,j+b)
        end
    end
    ret
end
